/* ---------- headers */

#define __STATIC_ARRAYS_TEMPLATES__

#include "input/input_xenon.h"

#include "cseries/constants.h"
#include "cseries/cseries_windows.h"
#include "game/game.h"
#include "input/input.h"
#include "input/input_agnostic.h"
#include "input/input_constants.h"
#include "input/input_xinput.h"
#include "interface/user_interface_controller.h"
#include "math/real_math.h"

#include "rex_macros.h"

#include <hidusage.h>
#include <Xinput.h>
#pragma comment(lib, "XInput.lib")

/* ---------- constants */

enum
{
	k_trigger_dead_zone = 6,
	// k_thumbstick_dead_zone = 7864,
};

constexpr real k_thumbstick_dead_zone = 0.24f;

/* ---------- definitions */

struct input_globals_xenon
{
	bool initialized; // 0x0
	bool suppressed_flag; // 0x1
	bool rumble_suppressed_flag; // 0x2
	rex::be<unsigned long> last_milliseconds; // 0x4

	rex::be<unsigned short> __flags; // 0x8

	char __dataA[8]; // 0xA

	bool valid_gamepads[4]; // 0x12
	gamepad_state_be gamepad_states[4]; // 0x16

	char __data106[0x12]; // 106

	gamepad_state_be gamepad_suppressed; // 0x118
	rumble_state_be rumble_states[4]; // 0x154

	char __data164[4]; // 0x164
};
static_assert(sizeof(input_globals_xenon) == 0x168);

struct s_rawinput_state
{
	bool initialized;

	HWND window;

	bool key_down[NUMBER_OF_KEYS];
	bool mouse_buttons[NUMBER_OF_MOUSE_BUTTONS];
	long mouse_delta[NUMBER_OF_MOUSE_AXES];
};

/* ---------- prototypes */

static void input_rawinput_process(const RAWINPUT* raw);
static void input_rawinput_poll(void);
static void input_update_gamepads(long elapsed_msec);
static void input_update_gamepads_rumble(void);

static void update_threshold(unsigned char* threshold, bool down, unsigned char current_value);
static void update_trigger(unsigned char input, unsigned char* output);
static void update_thumbstick(short input_x, short input_y, point2d* output);
static void update_thumbstick(short input_x, short input_y, point2d_be* output);

/* ---------- globals */

//static input_globals_xenon input_globals;
static REX_DATA_REFERENCE_DECLARE(0x828423F0, input_globals_xenon, input_globals);

